Диплом_2_часть/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Результат</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом_2_часть/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом_2_часть/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_2_часть/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом_2_часть/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
Функция МассовоеСоздание(Период) Экспорт
	 ОбработанныеДокументы = Новый Массив;
	 
	 Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда 
		 НачалоПериода = НачалоМесяца(Период.ДатаНачала);
		 КонецПериода = КонецМесяца(Период.ДатаОкончания);
	 Иначе
		 НачалоПериода = НачалоМесяца(Период);
		 КонецПериода = КонецМесяца(Период);
	 КонецЕсли;
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	 |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	 |	ДоговорыКонтрагентов.Организация КАК Организация,
	 |	ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка) КАК Реализация
	 |ИЗ
	 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 |ГДЕ
	 |	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	 
	 Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 ЗапросПроверки = Новый Запрос;
		 ЗапросПроверки.Текст = 
		 "ВЫБРАТЬ
		 |   РеализацияТоваровУслуг.Ссылка КАК Реализация
		 |ИЗ
		 |   Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		 |ГДЕ
		 |   РеализацияТоваровУслуг.Договор = &Договор
		 |   И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		 |   И РеализацияТоваровУслуг.Проведен
		 |   И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		 
		 ЗапросПроверки.УстановитьПараметр("Договор", Выборка.Договор);
		 ЗапросПроверки.УстановитьПараметр("НачалоПериода", НачалоПериода);
		 ЗапросПроверки.УстановитьПараметр("КонецПериода", КонецПериода);
		 
		 РезультатПроверки = ЗапросПроверки.Выполнить().Выбрать();
		 Если РезультатПроверки.Следующий() Тогда
			 Сообщить("Акт создан ранее, отмена операции" + РезультатПроверки.Реализация);
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, РезультатПроверки.Реализация, "Отказ", "Акт создан ранее"));
			 Продолжить;
		 КонецЕсли;
		 ТекущийДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		 ТекущийДокумент.Дата = КонецМесяца(Период.ДатаОкончания);
		 ТекущийДокумент.Контрагент = Выборка.Контрагент;
		 ТекущийДокумент.Договор = Выборка.Договор;
		 ТекущийДокумент.Организация = Выборка.Организация;
		  Попытка
			 ТекущийДокумент.ВыполнитьАвтозаполнение(); 
			 ТекущийДокумент.СуммаДокумента = ТекущийДокумент.Товары.Итог("Сумма") + ТекущийДокумент.Услуги.Итог("Сумма");
			 
			 ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение);
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, ТекущийДокумент.Ссылка, "Создано",""));
		 Исключение
			 ОбработанныеДокументы.Добавить(Новый Структура("ВКМ_Договор, ВКМ_Реализация, ВКМ_Статус, ВКМ_Комментарий", 
			 Выборка.Договор, Неопределено, "Ошибка", КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		 КонецПопытки;
	 КонецЦикла; 
	 Возврат ОбработанныеДокументы;
 КонецФункции
